import React from 'react';
import '../css/home.css';
import logoDarkBig from '../imges/Logo.png';
import logoDarkMin from '../imges/LogoDMin.png';
import logoLight from '../imges/LogoLight.png';
import achie from '../imges/achie.png';
import inachie from '../imges/inachie.png';
import AccountImg from '../imges/Account-Img.png';
import AccountBig from '../imges/Account-img-big.png';
import appStore from '../imges/appstore.png'
import googlePlay from '../imges/googleplay.png';
import Table from "../components/table";

const Home = () => {

    const [isOpenGames, setOpenGames] = React.useState(false);
    const [isOpenStatistic, setOpenStatistic] = React.useState(true);
    const [bySeasons, setSeasons] = React.useState(true);


    function accountMenu(e) {
        let AccountMenu = document.getElementById('account-menu');
        AccountMenu = AccountMenu.querySelector('ul');
        AccountMenu.style.position = 'relative';
        //alert(document.documentElement.clientWidth);
        if (document.documentElement.clientWidth <= 720) {
            let coords = getCoords(AccountMenu);
            let shiftX = e.pageX - coords.left;

            function moveAt(e) {
                if (AccountMenu.style.left <= 0 && +AccountMenu.style.left.slice(0, -2) + 800 - document.documentElement.clientWidth > 0) {
                    AccountMenu.style.left = e.pageX - shiftX + 'px';
                } else if (e.pageX - shiftX < 0 && +AccountMenu.style.left.slice(0, -2) + 800 - document.documentElement.clientWidth > 0) {
                    AccountMenu.style.left = e.pageX - shiftX + 'px';
                } else {
                    AccountMenu.style.left = e.pageX - shiftX + 'px';
                }
            }

            document.onmousemove = function (e) {
                moveAt(e);
            }

            AccountMenu.onmouseup = function () {
                document.onmousemove = null;
                AccountMenu.onmouseup = null;
            }

            function getCoords(elem) {   // кроме IE8-
                let box = elem.getBoundingClientRect();
                return {
                    top: box.top + window.pageYOffset,
                    left: box.left + window.pageXOffset
                };
            }
        }
    }

    return (
        <div className="home-container">
            <header>
                <div className="container header">
                    <div className="logo-mini dark">
                        <img id='logoDarkBig' src={logoDarkBig} alt="logo-dark"/>
                        <img id='logoDarkMin' src={logoDarkMin} alt="logo-dark"/>
                    </div>
                    <ul>
                        <li>Расписание</li>
                        <li>Игровые отчеты</li>
                        <li>Статистика</li>
                        <li>Ещё <svg id="arrow" width="12" height="8" viewBox="0 0 12 8" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M11 1.25L6 6.75L1 1.25" stroke="#ACAFF3" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
                        </svg></li>
                    </ul>
                    <div id="seasons">
                        <svg id="ball" width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M12 0C5.37266 0 0 5.37266 0 12C0 18.6273 5.37266 24 12 24C18.6273 24 24 18.6273 24 12C23.9926 5.37578 18.6242 0.0074219 12 0ZM21.2932 5.75605L20.4615 9.29121L16.0801 10.7516L12.4 7.80801V3.4707L16.6 1.79082C18.5016 2.65234 20.1262 4.025 21.2932 5.75605ZM21.36 18.1381L17.3932 18.7645L15.2332 15.9111L16.3336 11.5111L20.6664 10.0672L23.1484 13.0455C22.9793 14.8641 22.365 16.6131 21.36 18.1381ZM6.62441 18.7672L2.64004 18.1381C1.63496 16.6127 1.0209 14.8633 0.851953 13.0443L3.33203 10.066L7.66484 11.51L8.76523 15.9123L6.62441 18.7672ZM0.803516 11.8508C0.824805 10.0664 1.275 8.31309 2.11602 6.73926L2.76484 9.49922L0.803516 11.8508ZM9.51231 15.6L8.45117 11.3512L12 8.51231L15.5496 11.3523L14.4877 15.6H9.51231ZM21.2352 9.49766L21.884 6.7377C22.725 8.31152 23.1752 10.0646 23.1965 11.8492L21.2352 9.49766ZM15.5092 1.36602L12 2.76953L8.47207 1.37246C10.7557 0.611328 13.2242 0.60918 15.5092 1.36602ZM7.38086 1.8L11.6 3.47207V7.80801L7.91992 10.7516L3.53848 9.29121L2.70684 5.75605C3.86992 4.03125 5.4875 2.66211 7.38086 1.8ZM3.3084 19.0535L6.55996 19.5672L8.52637 22.6473C6.47832 21.9746 4.66699 20.7271 3.3084 19.0535ZM9.67324 22.9553L7.28633 19.2184L9.4 16.4H14.6L16.7439 19.232L14.6641 22.8771C13.0279 23.2801 11.3219 23.3074 9.67363 22.9572L9.67324 22.9553ZM15.7752 22.5436L17.4801 19.56L20.6932 19.0531C19.4023 20.6428 17.7018 21.8496 15.7752 22.5436Z" fill="#222222"/>
                        </svg>
                        <svg id="arrow" width="12" height="8" viewBox="0 0 12 8" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M11 1.25L6 6.75L1 1.25" stroke="#ACAFF3" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
                        </svg>
                    </div>
                    <div id="personal-area"><img src={AccountImg} alt="ball"/></div>
                    <div id="bag">
                        <svg width="18" height="24" viewBox="0 0 18 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M8.99999 0.800476C8.07175 0.800476 7.18153 1.16922 6.52517 1.82558C5.8688 2.48195 5.50006 3.37217 5.50006 4.30041V4.36201C4.03776 5.03244 2.79868 6.10862 1.93008 7.46264C1.06148 8.81666 0.59989 10.3916 0.600159 12.0003V19.0001C0.600159 20.114 1.04265 21.1823 1.83029 21.9699C2.61792 22.7575 3.68619 23.2 4.80008 23.2H13.1999C14.3138 23.2 15.3821 22.7575 16.1697 21.9699C16.9573 21.1823 17.3998 20.114 17.3998 19.0001V12.0003C17.4001 10.3916 16.9385 8.81666 16.0699 7.46264C15.2013 6.10862 13.9622 5.03244 12.4999 4.36201V4.30041C12.4999 3.37217 12.1312 2.48195 11.4748 1.82558C10.8185 1.16922 9.92823 0.800476 8.99999 0.800476ZM15.9999 14.8002H2.00013V12.0003C2.00013 10.1438 2.73761 8.36334 4.05034 7.05061C5.36307 5.73788 7.14352 5.00039 8.99999 5.00039C10.8565 5.00039 12.6369 5.73788 13.9496 7.05061C15.2624 8.36334 15.9999 10.1438 15.9999 12.0003V14.8002ZM4.80008 18.3001C4.80008 18.4858 4.87383 18.6638 5.0051 18.7951C5.13637 18.9264 5.31441 19.0001 5.50006 19.0001C5.68571 19.0001 5.86375 18.9264 5.99503 18.7951C6.1263 18.6638 6.20005 18.4858 6.20005 18.3001V16.2002H15.9999V19.0001C15.9999 19.7427 15.7049 20.4549 15.1798 20.98C14.6547 21.5051 13.9425 21.8001 13.1999 21.8001H4.80008C4.05748 21.8001 3.34531 21.5051 2.82022 20.98C2.29512 20.4549 2.00013 19.7427 2.00013 19.0001V16.2002H4.80008V18.3001ZM8.99999 3.60042C8.29161 3.60042 7.60422 3.68862 6.94763 3.85242C7.04919 3.38357 7.30822 2.96363 7.68162 2.66245C8.05501 2.36128 8.52027 2.19703 8.99999 2.19703C9.47971 2.19703 9.94497 2.36128 10.3184 2.66245C10.6918 2.96363 10.9508 3.38357 11.0524 3.85242C10.3944 3.68862 9.70838 3.60042 8.99999 3.60042Z" fill="#222222"/>
                        </svg>

                        <div className="count-number">1</div>
                    </div>
                    <div id="menu-burger">
                        <svg width="24" height="23" viewBox="0 0 24 23" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <rect width="24" height="3" rx="0.5" fill="#5A60E7"/>
                            <rect y="10" width="24" height="3" rx="0.5" fill="#5A60E7"/>
                            <rect y="20" width="13" height="3" rx="0.5" fill="#5A60E7"/>
                        </svg>

                    </div>
                </div>
            </header>
            <div className="container SwitcherSize">
                <div className="main-content">
                    <div id="side-menu">
                        <div id="player-area">
                            <div className="player-area-container">
                                <div id="logo-big">
                                    <img src={AccountBig} alt=""/>
                                </div>
                                <div id="contact-info">
                                    <div id="ratio">89.40</div>
                                    <div id="player-name">Елишакашвили Михо</div>
                                </div>
                            </div>
                            <div id="edit">
                                <svg id="edit-icon" width="14" height="14" viewBox="0 0 14 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M2.77081 11.0354L5.24998 10.4521L10.6708 5.03123C10.8986 4.80342 10.8986 4.43408 10.6708 4.20627L9.59996 3.1354C9.37216 2.90759 9.0028 2.90759 8.77501 3.1354L3.35415 8.55625L2.77081 11.0354Z" stroke="#ACAFF3" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
                                    <path d="M11.2291 11.0355H8.02081" stroke="#ACAFF3" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
                                </svg>
                                <svg width="82" height="14" viewBox="0 0 82 14" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M1.02584 10.5H2.02184V7.32H4.24184C5.82584 7.32 6.74984 6.216 6.74984 4.908C6.74984 3.6 5.84984 2.496 4.24184 2.496H1.02584V10.5ZM5.71784 4.908C5.71784 5.808 5.06984 6.432 4.12184 6.432H2.02184V3.384H4.12184C5.06984 3.384 5.71784 4.008 5.71784 4.908ZM7.54447 7.596C7.54447 9.408 8.78047 10.644 10.4965 10.644C11.4445 10.644 12.2245 10.332 12.8005 9.756L12.3685 9.168C11.9125 9.636 11.2405 9.9 10.5805 9.9C9.33247 9.9 8.56447 8.988 8.49247 7.896H13.1845V7.668C13.1845 5.928 12.1525 4.56 10.4005 4.56C8.74447 4.56 7.54447 5.916 7.54447 7.596ZM10.3885 5.304C11.7085 5.304 12.2845 6.372 12.2965 7.236H8.49247C8.54047 6.348 9.15247 5.304 10.3885 5.304ZM13.7941 9.708V11.976H14.5861V10.5H19.1821V11.976H19.9741V9.708H19.3021V4.704H15.3181L15.1981 6.036C14.9701 8.4 14.6101 9.264 14.3101 9.708H13.7941ZM15.9901 6.264L16.0621 5.496H18.4021V9.708H15.1861C15.4381 9.36 15.7981 8.544 15.9901 6.264ZM24.8287 10.5H25.7287V6.516C25.7287 5.112 24.7087 4.56 23.4847 4.56C22.5367 4.56 21.7927 4.872 21.1687 5.52L21.5887 6.144C22.1047 5.592 22.6687 5.34 23.3647 5.34C24.2047 5.34 24.8287 5.784 24.8287 6.564V7.608C24.3607 7.068 23.7007 6.816 22.9087 6.816C21.9247 6.816 20.8807 7.428 20.8807 8.724C20.8807 9.984 21.9247 10.644 22.9087 10.644C23.6887 10.644 24.3487 10.368 24.8287 9.84V10.5ZM24.8287 9.276C24.4807 9.756 23.8687 9.996 23.2327 9.996C22.3927 9.996 21.8047 9.468 21.8047 8.736C21.8047 7.992 22.3927 7.464 23.2327 7.464C23.8687 7.464 24.4807 7.704 24.8287 8.184V9.276ZM31.4808 10.5H32.6328L30.0528 7.332L32.6208 4.704H31.4808L28.4328 7.788V4.704H27.5328V10.5H28.4328V8.844L29.3928 7.896L31.4808 10.5ZM34.7529 10.5H35.6529V5.496H37.3449V4.704H33.0729V5.496H34.7529V10.5ZM38.525 10.5H39.389L42.449 5.988V10.5H43.349V4.704H42.461L39.425 9.132V4.704H38.525V10.5ZM46.0461 12.708V9.624C46.5141 10.272 47.2101 10.644 48.0021 10.644C49.5261 10.644 50.5821 9.468 50.5821 7.596C50.5821 5.712 49.5261 4.56 48.0021 4.56C47.1861 4.56 46.4661 4.98 46.0461 5.568V4.704H45.1461V12.708H46.0461ZM49.6341 7.596C49.6341 8.88 48.9381 9.84 47.7741 9.84C47.0661 9.84 46.3581 9.408 46.0461 8.904V6.288C46.3581 5.784 47.0661 5.364 47.7741 5.364C48.9381 5.364 49.6341 6.312 49.6341 7.596ZM54.5687 10.644C56.3327 10.644 57.4367 9.276 57.4367 7.596C57.4367 5.916 56.3327 4.56 54.5687 4.56C52.8047 4.56 51.7007 5.916 51.7007 7.596C51.7007 9.276 52.8047 10.644 54.5687 10.644ZM54.5687 9.84C53.3327 9.84 52.6367 8.784 52.6367 7.596C52.6367 6.42 53.3327 5.364 54.5687 5.364C55.8047 5.364 56.4887 6.42 56.4887 7.596C56.4887 8.784 55.8047 9.84 54.5687 9.84ZM58.9039 10.5H61.8919C63.1879 10.5 63.8479 9.864 63.8479 8.928C63.8479 8.268 63.3799 7.656 62.7679 7.512C63.2839 7.356 63.7279 6.888 63.7279 6.192C63.7279 5.316 63.0799 4.704 61.8679 4.704H58.9039V10.5ZM62.8039 6.324C62.8039 6.78 62.4799 7.128 61.8679 7.128H59.8039V5.496H61.8679C62.4679 5.496 62.8039 5.82 62.8039 6.324ZM62.9119 8.82C62.9119 9.372 62.5279 9.708 61.8919 9.708H59.8039V7.92H61.8919C62.5639 7.92 62.9119 8.352 62.9119 8.82ZM69.0084 10.5H69.9084V6.516C69.9084 5.112 68.8884 4.56 67.6644 4.56C66.7164 4.56 65.9724 4.872 65.3484 5.52L65.7684 6.144C66.2844 5.592 66.8484 5.34 67.5444 5.34C68.3844 5.34 69.0084 5.784 69.0084 6.564V7.608C68.5404 7.068 67.8804 6.816 67.0884 6.816C66.1044 6.816 65.0604 7.428 65.0604 8.724C65.0604 9.984 66.1044 10.644 67.0884 10.644C67.8684 10.644 68.5284 10.368 69.0084 9.84V10.5ZM69.0084 9.276C68.6604 9.756 68.0484 9.996 67.4124 9.996C66.5724 9.996 65.9844 9.468 65.9844 8.736C65.9844 7.992 66.5724 7.464 67.4124 7.464C68.0484 7.464 68.6604 7.704 69.0084 8.184V9.276ZM72.7685 10.5H73.6685V5.496H75.3605V4.704H71.0885V5.496H72.7685V10.5ZM77.4406 4.704H76.5406V10.5H79.5286C80.8246 10.5 81.4366 9.564 81.4366 8.64C81.4366 7.716 80.8366 6.78 79.5286 6.78H77.4406V4.704ZM77.4406 7.572H79.4566C80.2006 7.572 80.5126 8.064 80.5126 8.64C80.5126 9.216 80.1886 9.708 79.4566 9.708H77.4406V7.572Z" fill="#ACAFF3"/>
                                    <path d="M0.0898438 12.384H81.9046V13.032H0.0898438V12.384Z" fill="#ACAFF3"/>
                                </svg>

                            </div>
                        </div>
                        <div onMouseDown={accountMenu} id="account-menu">
                            <ul>
                                <li onClick={() => setOpenStatistic(!isOpenStatistic)}>
                                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M12 11.25C13.7949 11.25 15.25 9.79493 15.25 8C15.25 6.20507 13.7949 4.75 12 4.75C10.2051 4.75 8.75 6.20507 8.75 8C8.75 9.79493 10.2051 11.25 12 11.25Z" stroke="#ACAFF3" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
                                        <path d="M6.84771 19.25H17.1527C18.2946 19.25 19.1742 18.2681 18.641 17.2584C17.8565 15.7731 16.0682 14 12.0002 14C7.93223 14 6.14389 15.7731 5.35946 17.2584C4.82619 18.2681 5.70579 19.25 6.84771 19.25Z" stroke="#ACAFF3" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
                                    </svg>
                                    Статистика
                                    {isOpenStatistic ?
                                        <svg id="arrow" width="12" height="8" viewBox="0 0 12 8" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path d="M11 6.75L6 1.25L1 6.75" stroke="#ACAFF3" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
                                        </svg> :
                                        <svg id="arrow" width="12" height="8" viewBox="0 0 12 8" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path d="M11 1.25L6 6.75L1 1.25" stroke="#ACAFF3" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
                                        </svg>
                                    }
                                </li>
                                <div className="MenuStatistic">
                                    {isOpenStatistic ? <ul>
                                        <li>Футбол</li>
                                        <li>Баскетбол</li>
                                        <li>Волейбол</li>
                                    </ul> : ''}
                                </div>
                                <li onClick={() => setOpenGames(!isOpenGames)}>
                                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M4.75 8.75C4.75 7.64543 5.64543 6.75 6.75 6.75H17.25C18.3546 6.75 19.25 7.64543 19.25 8.75V17.25C19.25 18.3546 18.3546 19.25 17.25 19.25H6.75C5.64543 19.25 4.75 18.3546 4.75 17.25V8.75Z" stroke="#ACAFF3" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
                                        <path d="M8 4.75V8.25" stroke="#ACAFF3" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
                                        <path d="M16 4.75V8.25" stroke="#ACAFF3" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
                                        <path d="M7.75 10.75H16.25" stroke="#ACAFF3" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
                                    </svg>
                                    Ближайшие игры
                                </li>
                                <div className="MenuStatistic">
                                    {isOpenGames ? <ul>
                                        <li>Футбол 01/13</li>
                                        <li>Баскетбол 01/13</li>
                                        <li>Волейбол 01/13</li>
                                    </ul> : ''}
                                </div>
                                <li>
                                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M9 6.75H7.75C6.64543 6.75 5.75 7.64543 5.75 8.75V17.25C5.75 18.3546 6.64543 19.25 7.75 19.25H16.25C17.3546 19.25 18.25 18.3546 18.25 17.25V8.75C18.25 7.64543 17.3546 6.75 16.25 6.75H15" stroke="#ACAFF3" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
                                        <path d="M14 8.25H10C9.44772 8.25 9 7.80228 9 7.25V5.75C9 5.19772 9.44772 4.75 10 4.75H14C14.5523 4.75 15 5.19772 15 5.75V7.25C15 7.80228 14.5523 8.25 14 8.25Z" stroke="#ACAFF3" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
                                        <path d="M9.75 12.25H14.25" stroke="#ACAFF3" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
                                        <path d="M9.75 15.25H14.25" stroke="#ACAFF3" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
                                    </svg>
                                    Игровые отчеты
                                </li>
                                <li>
                                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M4.75 12.375C4.75 16.3791 7.99594 19.625 12 19.625C16.0041 19.625 19.25 16.3791 19.25 12.375C19.25 8.37094 16.0041 5.125 12 5.125C9.47437 5.125 7.25038 6.41645 5.95236 8.375M5.95236 8.375V4.375M5.95236 8.375H10" stroke="#ACAFF3" stroke-width="1.5"/>
                                        <path d="M12 8.375V12.375L14 14.375" stroke="#ACAFF3" stroke-width="1.5"/>
                                    </svg>
                                    История заказов
                                </li>
                                <li id="exit">
                                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M15.75 8.75L19.25 12L15.75 15.25" stroke="#ACAFF3" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
                                        <path d="M19 12H10.75" stroke="#ACAFF3" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
                                        <path d="M15.25 4.75H6.75C5.64543 4.75 4.75 5.64543 4.75 6.75V17.25C4.75 18.3546 5.64543 19.25 6.75 19.25H15.25" stroke="#ACAFF3" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
                                    </svg>
                                    Выйти
                                </li>
                            </ul>
                        </div>
                        <div className="menuOpenItem">
                            {isOpenStatistic ? <ul>
                                <li>Футбол</li>
                                <li>Баскетбол</li>
                                <li>Волейбол</li>
                            </ul> : ''}
                        </div>
                    </div>
                    <div className="statistics-content">
                        <div id="statistics">
                            <div className="achieve-block">
                                <div className="regular">
                                    <div className="active-achie">
                                        <ul>
                                            <li className="achie active">
                                                <img src={achie} alt=""/>
                                            </li>
                                            <li className="achie active">
                                                <img src={achie} alt=""/>
                                            </li>
                                            <li className="achie active">
                                                <img src={achie} alt=""/>
                                            </li>
                                        </ul>
                                    </div>
                                    <div className="inactive-achie">
                                        <ul>
                                            <li className="achie inactive">
                                                <img src={inachie} alt=""/></li>
                                            <li className="achie inactive">
                                                <img src={inachie} alt=""/></li>
                                        </ul>
                                    </div>
                                </div>
                                <hr/>
                                <div className="received-achie">
                                    <ul>
                                        <li className="achie active"><img src={achie} alt=""/></li>
                                        <li className="achie active"><img src={achie} alt=""/></li>
                                        <li className="achie active"><img src={achie} alt=""/></li>
                                        <li className="achie active"><img src={achie} alt=""/></li>
                                        <li className="achie active"><img src={achie} alt=""/></li>
                                    </ul>
                                </div>
                            </div>
                            <div className="toggle-games">
                                <div className='toggle'>
                                    <div className={bySeasons ? "card activeSeason" : 'card'} onClick={() => setSeasons(true)}>Все сезоны</div>
                                    <div className={bySeasons ? "card" : 'card activeSeason'} onClick={() => setSeasons(false)}>Сезон 2021/2020</div>
                                </div>
                                <div className='toggle-cards'>
                                    <ul>
                                        <li>
                                            <div className="toggle-name">Игры</div>
                                            <div className="toggle-count">36</div>
                                        </li>
                                        <li>
                                            <div className="toggle-name">Гол</div>
                                            <div className="toggle-count">67</div>
                                        </li>
                                        <li>
                                            <div className="toggle-name">Пас</div>
                                            <div className="toggle-count">136</div>
                                        </li>
                                        <li>
                                            <div className="toggle-name">Гол+пас</div>
                                            <div className="toggle-count">203</div>
                                        </li>
                                    </ul>
                                </div>

                            </div>
                            <div className="share-link">
                                <div className="share-text">Поделиться</div>
                                <div className="share-icons">
                                    <ul>
                                        <li>
                                            <svg width="26" height="26" viewBox="0 0 26 26" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path d="M25.5 13C25.5 6.0975 19.9025 0.5 13 0.5C6.0975 0.5 0.5 6.0975 0.5 13C0.5 19.9025 6.0975 25.5 13 25.5C13.0734 25.5 13.1465 25.4985 13.2197 25.4971V15.7664H10.5342V12.6367H13.2197V10.3335C13.2197 7.66248 14.8503 6.20869 17.233 6.20869C18.374 6.20869 19.3547 6.29376 19.6406 6.33172V9.12331H17.9976C16.7014 9.12331 16.4504 9.73939 16.4504 10.6433V12.6367H19.5498L19.1459 15.7664H16.4504V25.0171C21.6752 23.5192 25.5 18.7056 25.5 13Z" fill="white"/>
                                            </svg>
                                        </li>
                                        <li>
                                            <svg width="26" height="26" viewBox="0 0 26 26" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path d="M13 0.5C6.09635 0.5 0.5 6.09635 0.5 13C0.5 19.9036 6.09635 25.5 13 25.5C19.9036 25.5 25.5 19.9036 25.5 13C25.5 6.09635 19.9036 0.5 13 0.5ZM17.8073 14.6029C17.8073 14.6029 18.9128 15.694 19.1849 16.2005C19.1927 16.2109 19.1966 16.2214 19.1992 16.2266C19.3099 16.4128 19.3359 16.5573 19.2812 16.6654C19.1901 16.8451 18.8776 16.9336 18.7708 16.9414H16.8177C16.6823 16.9414 16.3984 16.9062 16.0547 16.6693C15.7904 16.4844 15.5299 16.181 15.276 15.8854C14.8971 15.4453 14.569 15.0651 14.2383 15.0651C14.1963 15.065 14.1545 15.0716 14.1146 15.0846C13.8646 15.1654 13.5443 15.5221 13.5443 16.4727C13.5443 16.7695 13.3099 16.9401 13.1445 16.9401H12.25C11.9453 16.9401 10.3581 16.8333 8.95182 15.3503C7.23047 13.5339 5.68099 9.89062 5.66797 9.85677C5.57031 9.62109 5.77213 9.49479 5.99219 9.49479H7.96484C8.22786 9.49479 8.3138 9.65495 8.3737 9.79687C8.44401 9.96224 8.70182 10.6198 9.125 11.3594C9.8112 12.5651 10.2318 13.0547 10.569 13.0547C10.6322 13.0539 10.6944 13.0379 10.75 13.0078C11.1901 12.763 11.1081 11.194 11.0885 10.8685C11.0885 10.8073 11.0872 10.1667 10.862 9.85937C10.7005 9.63672 10.4258 9.55208 10.2591 9.52083C10.3266 9.42775 10.4154 9.35227 10.5182 9.30078C10.8203 9.14974 11.3646 9.1276 11.9049 9.1276H12.2057C12.7917 9.13542 12.9427 9.17318 13.1549 9.22656C13.5846 9.32943 13.5938 9.60677 13.556 10.556C13.5443 10.8255 13.5326 11.1302 13.5326 11.4896C13.5326 11.5677 13.5286 11.651 13.5286 11.7396C13.5156 12.2227 13.5 12.7708 13.8411 12.9961C13.8856 13.024 13.9371 13.0389 13.9896 13.0391C14.1081 13.0391 14.4648 13.0391 15.431 11.3815C15.729 10.848 15.9879 10.2936 16.2057 9.72266C16.2253 9.6888 16.2826 9.58463 16.3503 9.54427C16.4002 9.5188 16.4556 9.50584 16.5117 9.50651H18.8307C19.0833 9.50651 19.2565 9.54427 19.2891 9.64193C19.3464 9.79687 19.2786 10.2695 18.2201 11.7031L17.7474 12.3268C16.7878 13.5846 16.7878 13.6484 17.8073 14.6029Z" fill="white"/>
                                            </svg>
                                        </li>
                                        <li>
                                            <svg width="26" height="26" viewBox="0 0 26 26" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path fill-rule="evenodd" clip-rule="evenodd" d="M13 25.5C19.9036 25.5 25.5 19.9036 25.5 13C25.5 6.09644 19.9036 0.5 13 0.5C6.09644 0.5 0.5 6.09644 0.5 13C0.5 19.9036 6.09644 25.5 13 25.5ZM17.4956 8.50435C16.1565 7.16529 13.9855 7.16529 12.6464 8.50435L12.6464 8.50435L11.7835 9.36729C11.5882 9.56255 11.5882 9.87914 11.7835 10.0744C11.9788 10.2697 12.2953 10.2697 12.4906 10.0744L13.3535 9.21147L13.3535 9.21146C14.3021 8.26291 15.84 8.26292 16.7885 9.21147C17.7371 10.16 17.7371 11.6979 16.7885 12.6465L15.9256 13.5094C15.7303 13.7047 15.7303 14.0212 15.9256 14.2165C16.1209 14.4118 16.4374 14.4118 16.6327 14.2165L17.4956 13.3536C18.8347 12.0145 18.8348 9.84342 17.4956 8.50435ZM14.9068 11.8003C15.1021 11.605 15.1021 11.2884 14.9068 11.0932C14.7116 10.8979 14.395 10.8979 14.1997 11.0932L11.0931 14.1998C10.8979 14.395 10.8979 14.7116 11.0931 14.9069C11.2884 15.1021 11.605 15.1021 11.8003 14.9069L14.9068 11.8003ZM10.0743 12.4906C10.2696 12.2954 10.2696 11.9788 10.0743 11.7835C9.87909 11.5883 9.5625 11.5883 9.36724 11.7835L8.5043 12.6465L8.5043 12.6465C7.16523 13.9856 7.16523 16.1566 8.5043 17.4957C9.84337 18.8348 12.0144 18.8348 13.3535 17.4957L14.2165 16.6327C14.4117 16.4375 14.4117 16.1209 14.2165 15.9256C14.0212 15.7304 13.7046 15.7304 13.5093 15.9256L12.6464 16.7886C11.6978 17.7371 10.16 17.7371 9.21141 16.7886C8.26286 15.84 8.26286 14.3022 9.21141 13.3536L9.21141 13.3536L10.0743 12.4906Z" fill="white"/>
                                            </svg>

                                        </li>
                                    </ul>
                                </div>
                                <div className="pattern">
                                    <svg width="152" height="152" viewBox="0 0 152 152" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M150.998 30.9986L121 0.999981" stroke="#5A60E7" stroke-width="2"/>
                                        <path d="M150.999 1.00153L121 31.0001" stroke="#5A60E7" stroke-width="2"/>
                                        <path d="M151 91.0001L121 61.0003" stroke="#5A60E7" stroke-width="2"/>
                                        <path d="M151 61.0001L121 90.9999" stroke="#5A60E7" stroke-width="2"/>
                                        <path d="M150.999 150.999L121 121" stroke="#5A60E7" stroke-width="2"/>
                                        <path d="M150.999 121.001L121 151" stroke="#5A60E7" stroke-width="2"/>
                                        <path d="M90.9995 90.9995L61 61" stroke="#5A60E7"/>
                                        <path d="M90.9985 61.001L60.999 91.0005" stroke="#5A60E7"/>
                                        <path d="M90.9988 151L60.999 121" stroke="#5A60E7"/>
                                        <path d="M90.9998 121.001L60.9999 151" stroke="#5A60E7"/>
                                        <path d="M30.9971 151L0.997072 121" stroke="#5A60E7" stroke-width="0.5"/>
                                        <path d="M30.999 121L0.999023 151" stroke="#5A60E7" stroke-width="0.5"/>
                                    </svg>

                                </div>
                            </div>
                        </div>
                        <div id="btn-format">
                            Формат <svg id="arrow" width="12" height="8" viewBox="0 0 12 8" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M11 1.25L6 6.75L1 1.25" stroke="#ACAFF3" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
                        </svg>
                        </div>
                        <div id="table-ratio">
                            <Table></Table>
                        </div>
                    </div>
                </div>
            </div>
            <footer>
                <div className="container">
                    <div className="footer-text">
                        <div className="contacts">
                            <div className="logo-light">
                                <img src={logoLight} alt=""/>
                            </div>
                            <div className="stores">
                                <div>
                                    <img src={appStore} alt="appstore"/>
                                </div>
                                <div>
                                    <img src={googlePlay} alt="google play"/>
                                </div>
                            </div>
                            <div className="contacts-link">
                                <h2>Наши контакты</h2>
                                <div>
                                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M8.89286 4.75H6.06818C5.34017 4.75 4.75 5.34017 4.75 6.06818C4.75 13.3483 10.6517 19.25 17.9318 19.25C18.6598 19.25 19.25 18.6598 19.25 17.9318V15.1071L16.1429 13.0357L14.5317 14.6468C14.2519 14.9267 13.8337 15.0137 13.4821 14.8321C12.8858 14.524 11.9181 13.9452 10.9643 13.0357C9.98768 12.1045 9.41548 11.1011 9.12829 10.494C8.96734 10.1537 9.06052 9.76091 9.32669 9.49474L10.9643 7.85714L8.89286 4.75Z" stroke="#FAF9F9" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
                                    </svg>+7 (495) 109-03-09
                                </div>
                                <div>
                                    <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M4.75 7.75C4.75 6.64543 5.64543 5.75 6.75 5.75H17.25C18.3546 5.75 19.25 6.64543 19.25 7.75V16.25C19.25 17.3546 18.3546 18.25 17.25 18.25H6.75C5.64543 18.25 4.75 17.3546 4.75 16.25V7.75Z" stroke="white" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
                                        <path d="M5.5 6.5L12 12.25L18.5 6.5" stroke="white" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round"/>
                                    </svg>go@crossball.ru
                                </div>
                            </div>
                        </div>
                        <div className="footer-info">
                            <div>
                                <h2>Разделы</h2>
                                <ul>
                                    <li>Главная</li>
                                    <li>Расписание</li>
                                    <li>Игровые счеты</li>
                                    <li>Статистика</li>
                                </ul>
                            </div>
                            <div>
                                <h2>Виды спорта</h2>
                                <ul>
                                    <li>Футбол</li>
                                    <li>Баскетбол</li>
                                    <li>Волейбол</li>
                                </ul>
                            </div>
                            <div>
                                <h2>Полезное</h2>
                                <ul>
                                    <li>Как записаться?</li>
                                    <li>Ответы на вопросы</li>
                                    <li>Достижения</li>
                                </ul>
                            </div>
                            <div>
                                <h2>Чё почём?</h2>
                                <ul>
                                    <li>Абонементы</li>
                                    <li>Корп. клиетнам</li>
                                    <li>Партнёры</li>
                                </ul>
                            </div>
                        </div>
                    </div>
                    <hr/>
                    <div className="copyright">
                        <p>© Все права защищены</p>
                        <div>
                            <svg width="240" height="40" viewBox="0 0 240 40" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M22.5602 20C22.5602 21.414 21.414 22.5603 20 22.5603C18.586 22.5603 17.4397 21.414 17.4397 20C17.4397 18.586 18.586 17.4398 20 17.4398C21.414 17.4398 22.5602 18.586 22.5602 20Z" fill="white"/>
                                <path fill-rule="evenodd" clip-rule="evenodd" d="M25.5851 15.7747C25.4703 15.4636 25.2872 15.182 25.0492 14.9509C24.8181 14.7129 24.5367 14.5298 24.2254 14.415C23.973 14.3169 23.5937 14.2002 22.8952 14.1684C22.1396 14.134 21.9131 14.1266 20.0001 14.1266C18.087 14.1266 17.8605 14.1338 17.105 14.1682C16.4065 14.2002 16.0271 14.3169 15.7749 14.415C15.4636 14.5298 15.182 14.7129 14.9511 14.9509C14.7131 15.182 14.53 15.4634 14.415 15.7747C14.3169 16.0271 14.2002 16.4065 14.1684 17.105C14.134 17.8605 14.1266 18.087 14.1266 20.0001C14.1266 21.9131 14.134 22.1396 14.1684 22.8952C14.2002 23.5937 14.3169 23.973 14.415 24.2254C14.53 24.5367 14.7129 24.8181 14.9509 25.0492C15.182 25.2872 15.4634 25.4703 15.7747 25.5851C16.0271 25.6834 16.4065 25.8001 17.105 25.8318C17.8605 25.8663 18.0868 25.8735 20 25.8735C21.9133 25.8735 22.1398 25.8663 22.8951 25.8318C23.5936 25.8001 23.973 25.6834 24.2254 25.5851C24.8503 25.3441 25.3441 24.8503 25.5851 24.2254C25.6832 23.973 25.7999 23.5937 25.8318 22.8952C25.8663 22.1396 25.8735 21.9131 25.8735 20.0001C25.8735 18.087 25.8663 17.8605 25.8318 17.105C25.8001 16.4065 25.6834 16.0271 25.5851 15.7747ZM20.0001 23.6788C17.9682 23.6788 16.3211 22.0319 16.3211 20C16.3211 17.968 17.9682 16.3211 20.0001 16.3211C22.0319 16.3211 23.679 17.968 23.679 20C23.679 22.0319 22.0319 23.6788 20.0001 23.6788ZM23.8245 17.0354C23.3497 17.0354 22.9647 16.6504 22.9647 16.1756C22.9647 15.7008 23.3497 15.3159 23.8245 15.3159C24.2993 15.3159 24.6842 15.7008 24.6842 16.1756C24.684 16.6504 24.2993 17.0354 23.8245 17.0354Z" fill="white"/>
                                <path fill-rule="evenodd" clip-rule="evenodd" d="M7.5 20C7.5 13.0975 13.0975 7.5 20 7.5C26.9025 7.5 32.5 13.0975 32.5 20C32.5 26.9025 26.9025 32.5 20 32.5C13.0975 32.5 7.5 26.9025 7.5 20ZM26.8008 24.7016C26.9782 24.245 27.0997 23.7233 27.1344 22.9593C27.1695 22.1938 27.1777 21.9493 27.1777 20C27.1777 18.0507 27.1695 17.8062 27.1346 17.0407C27.0997 16.2767 26.9784 15.755 26.8008 15.2984C26.6208 14.8195 26.3381 14.3857 25.9731 14.0271C25.6145 13.6619 25.1805 13.3792 24.7016 13.199C24.245 13.0218 23.7233 12.9005 22.9593 12.8658C22.1938 12.8307 21.9493 12.8223 20 12.8223C18.0507 12.8223 17.8062 12.8307 17.0407 12.8656C16.2767 12.9005 15.755 13.0218 15.2984 13.1992C14.8195 13.3794 14.3855 13.6619 14.0271 14.0271C13.6619 14.3855 13.3792 14.8195 13.199 15.2984C13.0216 15.755 12.9003 16.2767 12.8656 17.0407C12.8305 17.8062 12.8223 18.0507 12.8223 20C12.8223 21.9493 12.8305 22.1938 12.8658 22.9594C12.9005 23.7233 13.022 24.2452 13.1993 24.7016C13.3796 25.1805 13.6621 25.6145 14.0271 25.9729C14.3857 26.3381 14.8195 26.6206 15.2986 26.8008C15.755 26.9782 16.2769 27.0995 17.0407 27.1344C17.8064 27.1693 18.0507 27.1777 20.0002 27.1777C21.9495 27.1777 22.194 27.1693 22.9594 27.1344C23.7233 27.0995 24.2452 26.9782 24.7016 26.8008C25.6658 26.428 26.428 25.6658 26.8008 24.7016Z" fill="white"/>
                                <path d="M60 7.5C53.0964 7.5 47.5 13.0964 47.5 20C47.5 26.9036 53.0964 32.5 60 32.5C66.9036 32.5 72.5 26.9036 72.5 20C72.5 13.0964 66.9036 7.5 60 7.5ZM64.8073 21.6029C64.8073 21.6029 65.9128 22.694 66.1849 23.2005C66.1927 23.2109 66.1966 23.2214 66.1992 23.2266C66.3099 23.4128 66.3359 23.5573 66.2812 23.6654C66.1901 23.8451 65.8776 23.9336 65.7708 23.9414H63.8177C63.6823 23.9414 63.3984 23.9062 63.0547 23.6693C62.7904 23.4844 62.5299 23.181 62.276 22.8854C61.8971 22.4453 61.569 22.0651 61.2383 22.0651C61.1963 22.065 61.1545 22.0716 61.1146 22.0846C60.8646 22.1654 60.5443 22.5221 60.5443 23.4727C60.5443 23.7695 60.3099 23.9401 60.1445 23.9401H59.25C58.9453 23.9401 57.3581 23.8333 55.9518 22.3503C54.2305 20.5339 52.681 16.8906 52.668 16.8568C52.5703 16.6211 52.7721 16.4948 52.9922 16.4948H54.9648C55.2279 16.4948 55.3138 16.6549 55.3737 16.7969C55.444 16.9622 55.7018 17.6198 56.125 18.3594C56.8112 19.5651 57.2318 20.0547 57.569 20.0547C57.6322 20.0539 57.6944 20.0379 57.75 20.0078C58.1901 19.763 58.1081 18.194 58.0885 17.8685C58.0885 17.8073 58.0872 17.1667 57.862 16.8594C57.7005 16.6367 57.4258 16.5521 57.2591 16.5208C57.3266 16.4277 57.4154 16.3523 57.5182 16.3008C57.8203 16.1497 58.3646 16.1276 58.9049 16.1276H59.2057C59.7917 16.1354 59.9427 16.1732 60.1549 16.2266C60.5846 16.3294 60.5938 16.6068 60.556 17.556C60.5443 17.8255 60.5326 18.1302 60.5326 18.4896C60.5326 18.5677 60.5286 18.651 60.5286 18.7396C60.5156 19.2227 60.5 19.7708 60.8411 19.9961C60.8856 20.024 60.9371 20.0389 60.9896 20.0391C61.1081 20.0391 61.4648 20.0391 62.431 18.3815C62.729 17.848 62.9879 17.2936 63.2057 16.7227C63.2253 16.6888 63.2826 16.5846 63.3503 16.5443C63.4002 16.5188 63.4556 16.5058 63.5117 16.5065H65.8307C66.0833 16.5065 66.2565 16.5443 66.2891 16.6419C66.3464 16.7969 66.2786 17.2695 65.2201 18.7031L64.7474 19.3268C63.7878 20.5846 63.7878 20.6484 64.8073 21.6029Z" fill="white"/>
                                <path d="M112.5 20C112.5 13.0975 106.903 7.5 100 7.5C93.0975 7.5 87.5 13.0975 87.5 20C87.5 26.9025 93.0975 32.5 100 32.5C100.073 32.5 100.146 32.4985 100.22 32.4971V22.7664H97.5342V19.6367H100.22V17.3335C100.22 14.6625 101.85 13.2087 104.233 13.2087C105.374 13.2087 106.355 13.2938 106.641 13.3317V16.1233H104.998C103.701 16.1233 103.45 16.7394 103.45 17.6433V19.6367H106.55L106.146 22.7664H103.45V32.0171C108.675 30.5192 112.5 25.7056 112.5 20Z" fill="white"/>
                                <path d="M142.594 20.0001L138.349 22.5944V17.4057L142.594 20.0001Z" fill="white"/>
                                <path fill-rule="evenodd" clip-rule="evenodd" d="M127.5 20C127.5 13.0975 133.097 7.5 140 7.5C146.903 7.5 152.5 13.0975 152.5 20C152.5 26.9025 146.903 32.5 140 32.5C133.097 32.5 127.5 26.9025 127.5 20ZM147.489 23.7703C147.811 22.5478 147.811 20.0128 147.811 20.0128C147.811 20.0128 147.824 17.4651 147.489 16.2427C147.309 15.5736 146.781 15.0459 146.112 14.8658C144.89 14.5312 140 14.5312 140 14.5312C140 14.5312 135.11 14.5312 133.888 14.853C133.232 15.0331 132.691 15.5736 132.511 16.2427C132.189 17.4651 132.189 20 132.189 20C132.189 20 132.189 22.5478 132.511 23.7573C132.691 24.4264 133.219 24.9541 133.888 25.1342C135.123 25.4688 140 25.4688 140 25.4688C140 25.4688 144.89 25.4688 146.112 25.147C146.781 24.9669 147.309 24.4394 147.489 23.7703Z" fill="white"/>
                                <path fill-rule="evenodd" clip-rule="evenodd" d="M192.5 20C192.5 26.9031 186.903 32.5 180 32.5C173.097 32.5 167.5 26.9031 167.5 20C167.5 13.0969 173.097 7.5 180 7.5C186.903 7.5 192.5 13.0969 192.5 20ZM180.448 16.7281C179.232 17.2333 176.802 18.2802 173.158 19.8677C172.567 20.1031 172.256 20.3333 172.228 20.5583C172.18 20.9396 172.657 21.0896 173.305 21.2927C173.394 21.3208 173.485 21.349 173.579 21.3802C174.218 21.5875 175.076 21.8302 175.522 21.8396C175.927 21.8479 176.379 21.6812 176.878 21.3396C180.282 19.0406 182.04 17.8792 182.15 17.8542C182.228 17.8365 182.336 17.8135 182.409 17.8792C182.482 17.9437 182.475 18.0667 182.468 18.1C182.42 18.301 180.551 20.0396 179.582 20.9396C179.28 21.2198 179.067 21.4187 179.023 21.4646C178.925 21.5656 178.825 21.6625 178.729 21.7552C178.135 22.326 177.692 22.7552 178.754 23.4552C179.265 23.7917 179.673 24.0698 180.08 24.3469C180.525 24.65 180.969 24.9521 181.544 25.3292C181.69 25.425 181.829 25.524 181.966 25.6208C182.483 25.9906 182.949 26.3219 183.524 26.2698C183.857 26.2385 184.203 25.925 184.378 24.9885C184.792 22.774 185.606 17.9781 185.795 16.001C185.806 15.8369 185.799 15.672 185.774 15.5094C185.759 15.3781 185.695 15.2572 185.595 15.1708C185.446 15.049 185.215 15.0229 185.11 15.025C184.641 15.0333 183.92 15.2844 180.448 16.7281Z" fill="white"/>
                                <path fill-rule="evenodd" clip-rule="evenodd" d="M219.167 31.6667C226.07 31.6667 231.667 26.0702 231.667 19.1667C231.667 12.2631 226.07 6.66669 219.167 6.66669C212.263 6.66669 206.667 12.2631 206.667 19.1667C206.667 26.0702 212.263 31.6667 219.167 31.6667ZM222.059 12.2299C222.966 12.6041 223.789 13.1537 224.481 13.8468C225.176 14.536 225.728 15.3555 226.103 16.258C226.478 17.1605 226.669 18.128 226.667 19.1046C226.665 23.2032 223.314 26.5375 219.198 26.5375H219.195C217.948 26.537 216.721 26.2259 215.626 25.6325L211.667 26.6667L212.726 22.8157C212.073 21.6879 211.729 20.4095 211.729 19.0996C211.731 15.0011 215.082 11.6667 219.198 11.6667C220.18 11.6642 221.152 11.8556 222.059 12.2299ZM219.196 25.2831H219.198C222.619 25.2831 225.404 22.511 225.405 19.1046C225.408 18.2927 225.249 17.4884 224.937 16.7382C224.625 15.9879 224.167 15.3066 223.589 14.7336C223.014 14.1579 222.331 13.7013 221.577 13.3903C220.824 13.0793 220.016 12.9201 219.201 12.922C215.776 12.922 212.992 15.6933 212.99 19.0996C212.989 20.2628 213.318 21.4026 213.94 22.3876L214.087 22.6211L213.46 24.9006L215.81 24.287L216.036 24.4212C216.992 24.9855 218.084 25.2832 219.196 25.2831ZM221.328 20.051C221.499 20.1131 222.416 20.5619 222.603 20.6554C222.64 20.6735 222.673 20.6899 222.705 20.705C222.835 20.7677 222.924 20.8105 222.961 20.8732C223.008 20.951 223.008 21.3228 222.852 21.7567C222.697 22.1905 221.951 22.5863 221.593 22.6393C221.271 22.6865 220.864 22.7072 220.417 22.5656C220.147 22.4795 219.799 22.3652 219.353 22.174C217.602 21.4211 216.419 19.7312 216.197 19.4147C216.182 19.3929 216.171 19.3776 216.165 19.3696L216.163 19.3663C216.061 19.2307 215.403 18.3543 215.403 17.4478C215.403 16.5924 215.825 16.1445 216.019 15.9378C216.033 15.9236 216.045 15.9106 216.056 15.8986C216.119 15.8279 216.195 15.7708 216.281 15.7309C216.367 15.691 216.46 15.6692 216.554 15.6668C216.673 15.6663 216.792 15.6685 216.911 15.6734C216.924 15.674 216.938 15.6738 216.952 15.6737C217.061 15.6727 217.197 15.6715 217.331 15.9905C217.383 16.1152 217.459 16.3008 217.54 16.4961C217.7 16.8831 217.875 17.3078 217.906 17.3699C217.954 17.4627 217.984 17.5712 217.922 17.6953C217.913 17.7142 217.904 17.7319 217.896 17.7489C217.849 17.8436 217.815 17.913 217.736 18.005C217.705 18.0412 217.673 18.0802 217.64 18.1192C217.576 18.1972 217.512 18.2752 217.456 18.3304C217.362 18.4232 217.265 18.5233 217.374 18.7096C217.483 18.8959 217.857 19.5037 218.412 19.9964C219.009 20.5258 219.527 20.7496 219.79 20.8629C219.841 20.8849 219.883 20.9028 219.913 20.9179C220.099 21.0106 220.208 20.9957 220.317 20.8715C220.426 20.7473 220.784 20.3292 220.909 20.1437C221.034 19.9583 221.157 19.9889 221.328 20.051Z" fill="white"/>
                            </svg>

                        </div>
                        <p>Сделали в Spans</p>
                    </div>
                </div>
            </footer>
        </div>
    )
}

export default Home;